Autodesk.Revit.DB.Electrical.ConduitSettings.GetConduitSettings(Autodesk.Revit.DB.Document)
Gets the conduit settings of the project.
document:
The document.
Returns:
The conduit settings of the project.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.Electrical.ConduitSettings.ConnectorSeparator
The conduit connector separator string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.Electrical.ConduitSettings.SizePrefix
The conduit size prefix string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.Electrical.ConduitSettings.SizeSuffix
The conduit size suffix string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2017